app/controllers/assessments_controller.rb

    def index
      assesments = Assessment.all
---
SELECT "assessments".* FROM "assessments"