app/controllers/assignments_controller.rb

SELECT "assignments".* FROM "assignments"
---
    def index
        assignments = Assignment.all