app/controllers/parent_sessions_controller.rb

    def create
        parent = Parent.find_by(username: params[:username])
---
SELECT "parents".* FROM "parents" WHERE "parents"."username" = ? LIMIT ?  [["username", "mariam"], ["LIMIT", 1]]