app/controllers/persistence_controller.rb

    def admin
        admin = Admin.find_by(id: session[:admin_id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def teacher
        teacher = Teacher.find_by(id: session[:teacher_id])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def student
        puts "yyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyy"
        puts "yyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyy"
        puts "yyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyy"


        puts session[:student_id]

        student = Student.find_by(id: session[:student_id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def parent
        parent = Parent.find_by(id: session[:parent_id])
---
SELECT "parents".* FROM "parents" WHERE "parents"."id" IS NULL LIMIT ?  [["LIMIT", 1]]