app/controllers/student_sessions_controller.rb

    def create
        #student = Student.find_by(username: params[:username])
        student = Student.find_by(username: params[:username])
---
SELECT "students".* FROM "students" WHERE "students"."username" = ? LIMIT ?  [["username", "siti"], ["LIMIT", 1]]