app/controllers/student_assignments_controller.rb

    def par_stu_assignments
        student_assignments = StudentAssignment.where(student_id: params[:id])
---
SELECT "student_assignments".* FROM "student_assignments" WHERE "student_assignments"."student_id" = ?  [["student_id", 1]]