app/controllers/student_assesments_controller.rb

SELECT "student_assesments".* FROM "student_assesments"
---
    def index
        render json: StudentAssesment.all

SELECT "student_assesments".* FROM "student_assesments" WHERE "student_assesments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        student_assessment = StudentAssesment.find(params[:id])

SELECT "student_assesments".* FROM "student_assesments" WHERE "student_assesments"."student_id" = ?  [["student_id", 1]]
---
    def update
        student_assesment = StudentAssesment.find(params[:id])

SELECT "student_assesments".* FROM "student_assesments" WHERE "student_assesments"."student_id" = ?  [["student_id", 1]]
---
    def par_stu_assesments
        student_assesments = StudentAssesment.where(student_id: params[:id])