app/controllers/students_controller.rb

def create
  @admin = Admin.find_by(id: session[:admin_id])
  if @admin
    student = Student.create!(student_params)
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "students" ("role", "gender", "image", "parent_id", "phone_no", "admission_no", "subject_id", "full_name", "email", "password_digest", "created_at", "updated_at", "classroom_id", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

def destroy
  student =Student.find_by(id: params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" IS NULL LIMIT ?  [["LIMIT", 1]]

  def student_parent
    @parent = Parent.find_by(id: session[:parent_id])
    if @parent
      students = Student.where(parent_id: @parent.id)
---
SELECT "parents".* FROM "parents" WHERE "parents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."parent_id" = ?  [["parent_id", 1]]