app/controllers/student_assignments_controller.rb

SELECT "student_assignments".* FROM "student_assignments"
---
    def index
        render json: StudentAssignment.all

SELECT "student_assesments".* FROM "student_assesments" WHERE "student_assesments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        student_assignment = StudentAssesment.find(params[:id])