app/controllers/subjects_controller.rb

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
      subject = Subject.find_by(id: params[:id])

INSERT INTO "subjects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Sociology"], ["created_at", "2022-10-24 07:42:23.304055"], ["updated_at", "2022-10-24 07:42:23.304055"]]
---
 def create
  subject = Subject.create(subject_params)