app/controllers/teachers_controller.rb

INSERT INTO "teachers" ("role", "gender", "image", "phone_no", "address", "full_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      teacher = Teacher.create(teacher_params)