app/controllers/teachers_controller.rb

    def index
        teachers = Teacher.all
---
SELECT "teachers".* FROM "teachers"

    def show
        teacher = Teacher.find_by(id: params[:id])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def create
      teacher = Teacher.create(teacher_params)
---
INSERT INTO "teachers" ("role", "gender", "image", "phone_no", "address", "full_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
      teacher =Teacher.find_by(id: params[:id])


      if teacher
        teacher.update(teacher_params)
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "teachers" SET "address" = ?, "full_name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "teachers"."id" = ?  [["address", " East-west"], ["full_name", "Jeff Dahmer"], ["email", "jeffreyy@gmail.com"], ["password_digest", "[FILTERED]"], ["updated_at", "2022-10-24 07:12:23.577399"], ["id", 4]]