app/controllers/teacher_sessions_controller.rb

    def create
        teacher = Teacher.find_by(username: params[:username])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."username" = ? LIMIT ?  [["username", "deno"], ["LIMIT", 1]]